{
  "lifetime": [
    {
      "time": "公元前551年",
      "description": "孔子诞生"
    },
    {
      "time": "公元前550年",
      "description": "孔子两岁"
    },
    {
      "time": "公元前549年",
      "description": "孔子父亲叔梁死，葬于防（今曲阜市东二十五里处之防山，今称梁公"
    },
    {
      "time": "公元前548年",
      "description": "五月，齐崔杼杀齐庄公，立其弟，是为景公。晏婴评论道：“作为百姓的君主，难道是用他的地位来高踞于百姓之上？应当以治理国家为主。作为君主的臣子，难道是为了俸禄？应当维护国家利益。”（见《左传·襄公二十五年》）在这以前，随国的季梁就提出：“夫民，神之主也，是以圣王先成民而后致力于神。”（《左传·桓公六年》）邾文公亦提出：“苟利于民，孤之利也，天生民而树之君，以利之也，民既利矣，孤必与焉。”（《左传·文公十三年》）凡此种种，都是从西周的保民思想发展来的，也是孔子仁的思想的渊源。"
    },
    {
      "time": "公元前547年",
      "description": "孔子弟子秦商生，商字不慈，鲁国人。"
    },
    {
      "time": "公元前546年",
      "description": "孔子在母亲颜徵在的教育下，自幼好礼，“为儿嬉戏，常陈俎豆，设礼容”（《史记·孔子世家》），演习礼仪。弟子颜繇、曾点生。繇又名无繇，字季路，又称颜路，为颜渊为父。点字皙，曾参之父，鲁国人。"
    },
    {
      "time": "公元前545年",
      "description": "周灵王死，子贵立，是为周景王。弟子冉耕生。耕字伯牛，鲁国人。"
    },
    {
      "time": "公元前544年",
      "description": "吴公子季札赴鲁观周礼——鲁系周公封地，可用天子礼乐，故保存周礼较完备。"
    },
    {
      "time": "公元前543年",
      "description": "此年郑国子产执政，“使都鄙有章，上下有服，田有封洫，庐井有伍。”（《左传·襄公三十年》）郑国大治。后来孔子对子产政绩评价很高。"
    },
    {
      "time": "公元前542年",
      "description": "郑人游于乡校，议执政善否。然明劝子产毁乡校，子产不听，曰：“其所善者，吾则行之，其所恶者，吾则改之，是吾师也，若之何毁之？”孔子后来评价子产的这些话说：“以是观之，人谓子产不仁，吾不信也。”（均见《左传·襄公三十一年》）可见孔子对子产尊重民意评价很高。鲁襄公死，其子裯继位，是为昭公。弟子仲由生。由字子路，卞人。"
    },
    {
      "time": "公元前541年",
      "description": "孔子十一岁"
    },
    {
      "time": "公元前540年",
      "description": "春，晋侯使韩宣子聘鲁，观书于太史氏，见《易象》与《鲁春秋》，说：“周礼尽在鲁矣。吾乃今知周公之德与周之所以王也。”（《左传·昭公二年》）此类文献大概为鲁国所专藏。弟子漆雕开生。开字子若，蔡人。"
    },
    {
      "time": "公元前539年",
      "description": "齐晏婴使晋，与晋卿叔向谈及齐政将归陈（田）氏，因齐君加重赋税，滥取于民，而陈氏则采用施恩人民、收为己助的办法，以弱公室。叔向认为晋国公室也到了末世，人们听到国君的命令，“如逃寇仇”（《左传·昭公三年》）。可见这时阶级矛盾和统治阶级内部矛盾已很尖锐。"
    },
    {
      "time": "公元前538年",
      "description": "孔子在鲁。孔子说：“吾少也贱，故多能鄙事。”（《论语·子罕》）说明他少年时代从事过各种劳动。冬，郑国子产制定丘赋制度。"
    },
    {
      "time": "公元前537年",
      "description": "孔子说：“吾十有五而志于学。”（《论语·为政》）此时孔子在童年艰苦学习的基础上，更自觉地在学问德业上不断提高完善自己。鲁改三军为四军，叔孙、孟孙各领一军，季孙领二军。当时军、赋统一，分军即分赋，所以当时称此举为“四分公室”（《左传·昭公五年》）。"
    },
    {
      "time": "公元前536年",
      "description": "三月，郑国铸刑书。“礼治”衰替，法治渐起。弟子闵损生。损字子騫，鲁国人。"
    },
    {
      "time": "公元前535年",
      "description": "孔母颜徵在卒，孔子将父母尸柩合葬于防。防即今曲阜东十余公里的防山，现在这里有梁公林（林或作“陵”），相传为埋葬孔子父母及伯尼的地方。十一月，鲁执政季武子卒。"
    },
    {
      "time": "公元前534年",
      "description": "传说孔子身长九尺六寸，世人皆以“长人”称之（见《史记·孔子世家》）。"
    },
    {
      "time": "公元前533年",
      "description": "孔子取宋人亓官氏之女为妻（见《孔子家语·本姓解》）。"
    },
    {
      "time": "公元前532年",
      "description": "生子伯鱼，因鲁君以鲤赐孔子，故以鲤为名而字伯鱼。孔子开始任委吏（管仓库小吏）（见《阙里志·年谱》）"
    },
    {
      "time": "公元前531年",
      "description": "孔子改做乘田吏，管理牛羊畜牧小吏（见《阙里志·年谱》）。"
    },
    {
      "time": "公元前530年",
      "description": "弟子南宫适（敬叔）生。适字子容，鲁国孟僖子之次子。长子孟懿子亦为孔子弟子。"
    },
    {
      "time": "公元前529年",
      "description": "晋会诸侯于平丘，子产、子太叔相郑伯以会。……及盟，子产争承（争取使郑国少贡）。……自日中以争，至于昏，晋人许之。孔子认为“子产于是行也，足以为国基矣”（《左传·昭公十三年》）。"
    },
    {
      "time": "公元前528年",
      "description": "春，鲁季孙氏家臣南蒯在费地叛，费人逐之，奔齐。"
    },
    {
      "time": "公元前527年",
      "description": "孔子二十五岁"
    },
    {
      "time": "公元前526年",
      "description": "孔子二十六岁"
    },
    {
      "time": "公元前525年",
      "description": "郯子朝鲁，在宴会上，他回答叔孙昭子之问，谈起其祖先少皞氏的官制。据《左传·昭公十七年》记载：“仲尼闻之，见于郯子而学之。既而告人曰：‘吾闻之，天子失官，学在四夷，犹信。’”孔子好学，学无常师，此其一例。在孔子二十七岁时（前525年，鲁昭公十七年），鲁国东南方有一个鲁的附庸小国郯国的郯子来朝见鲁公。在一次宴会上，鲁国大夫昭子（名叔孙婼）问起郯子关于少昊时以鸟名官的情况，郯子作了详细回答。孔子听到此消息，便马上去拜见郯子，向他请教少昊氏时代职官制度的历史情况。后来，他对人说：“我听说，‘天子那里没有主管这类事的人了，这类学问却还保存在四方蛮夷那里。’这话倒是真的呢。”《左传·昭公十七年》：“秋，郯子来朝，公与之宴。昭子问焉，曰：‘少皞（昊）氏鸟名官，何故也？’郯子曰：‘吾祖也，我知之。……我高祖少皞挚之立也，凤鸟适至，故纪于鸟，为鸟师而鸟名……’……仲尼闻之，见于郯子而学之。既而告人曰：‘吾闻之，天子失官，学在四夷，犹信。’”这是历史上有名的孔子向郯子学习的故事，说明孔子确是不放弃任何一个可以请教学习机会的好学的人。"
    },
    {
      "time": "公元前524年",
      "description": "宋、卫、陈、郑皆有火灾。郑国裨灶认为，如不祭天禳灾，郑国还要再次发生火灾。子产不同意这种意见，认为“天道远，人道迩，非所及也，何以知之？”（《左传·昭公十八年》）这种把天道和人道分开的观点对孔子重人道轻天道思想的形成有很大影响。"
    },
    {
      "time": "公元前523年",
      "description": "孔子学琴于师襄子（一说此为鲁昭公十七年事，今从《阙里志》）。襄子曰：“吾虽以击磬为官，然能于琴。今子于琴已习，可以益矣。”孔子曰：“丘未得其数也。”有间，曰：“已习其数，可以益矣。”孔子曰：“丘未得其志也。”有间，曰：“已习其志，可以益矣。”孔子曰：“丘未得其为人也。”有间，孔子有所缪（穆）然思焉，有所睪（怡）然高望而远眺，曰：“丘殆得其为人矣。近黮而黑，颀然长，旷（《史记》作“眼”）如望羊，奄有四方，非文王其孰能为此？”师襄子避席葉拱（《史记》“葉拱”作“再拜”）而对曰：“君子圣人也，其传曰《文王操》”（《孔子家语·辩乐解》）于此可见孔子学艺之勤之精。"
    },
    {
      "time": "公元前522年",
      "description": "孔子自称“三十而立”（《论语·为政》），盖自此时，他已奠定了治学、作人、为政等坚实的学问德业基础。根据《史记》记载，此年前后，他开始创办平民教育，收徒讲学，在最早的弟子中，比较知名的有颜路、曾点、子路等人。郑国子产卒，仲尼闻之，为之出涕，曰：“古之遗爱也。”（《左传·昭公二十年》）他认为子产“有君子之道四焉：‘其行己也恭，其事上也敬，其养民也惠，其使民也义。’”（《论语·公冶长》）评价极高。齐景公与晏婴来适鲁。景公问孔子，秦穆公何以能称霸，孔子答以善于用人（《史记·孔子世家》）。弟子颜回、冉雍、冉求、商瞿、梁鱣生。回字渊，雍字仲弓，求字子有，瞿字子木，鲁国人；鱣字叔鱼，齐人。"
    },
    {
      "time": "公元前521年",
      "description": "弟子巫马施、高柴、宓不齐生。施字子期，陈国人；柴字子高，齐国人；不齐字子贱，鲁国人。"
    },
    {
      "time": "公元前520年",
      "description": "四月，周景王卒，子猛立，即悼王。王子朝联络旧官、百工与灵、景之族造反，杀悼王自立。晋人攻之，立景王另一子匄，是为周敬王。弟子端木赐生。赐字子贡，卫国人。"
    },
    {
      "time": "公元前519年",
      "description": "孔子三十三岁"
    },
    {
      "time": "公元前518年",
      "description": "孟僖子将死，嘱其二子孟懿子与南宫敬叔向孔子学礼（见《左传·昭公七年》）。孔子得到鲁君的支持，与南宫敬叔适周，观周朝文物制度，收获极大，说：“周监于二代（夏、商），郁郁乎文哉！吾从周。”（《论语·八佾》）（此时南宫敬叔仅十二三岁，似不可能随同孔子适周，崔述等皆疑之。适周之事，时间上可能后些。）"
    },
    {
      "time": "公元前517年",
      "description": "鲁昭公帅师攻伐季孙氏，季孙、叔孙、孟孙三家联合反抗昭公，昭公师败奔齐。孔子因鲁乱适齐，路经泰山，遇一因避家乡苛政而逃此的女子哭诉亲人被虎咬死仍不愿离开此地时，不由发出“苛政猛于虎”的慨叹（见《礼记·檀弓下》）。到齐国后，为高昭子家臣，藉以进见齐景公。孔子三十五岁（鲁昭公二十五年，前517年），因为鲁国内乱而适齐。内乱有远因，有近因。远因是由来已久的鲁国公室衰微、世卿专横、政在季氏的局面，这使鲁昭公不得不想方设法削弱以至铲除季平子，以恢复公室权力。近因是这年夏天，恰好由于季平子和另一贵族郈昭伯两家斗鸡而引起纠纷，鲁昭公就利用这一矛盾，支持郈氏，抑制季氏，并一直发展到联络郈氏和另一贵族臧昭伯秘密策划，在同年秋天出兵围困季平子。就这样在远因、近因鼓荡下，昭公和季氏的斗争便成了你死我活的斗争。这场斗争的结局，要看另外两个世卿——叔孙氏和孟孙氏站在哪边。开始叔孙氏和家臣商量采取什么态度时，家臣们都认为“如果灭了季氏，我们叔孙氏也就不存在了”《左传·昭公二十五年》叔孙氏和家臣商量，首先问：“凡有季氏与无，于我孰利？”皆曰：“无季氏，是无叔孙氏也。”。于是叔孙氏立即发兵援救季平子。正在观望的孟孙氏看到叔孙氏已起兵救季氏，自己也就决定响应，并将鲁昭公派去联络的郈昭伯杀死，以示决心。这样，加上其他因素（如内部不团结等），鲁昭公大败，被迫逃亡齐国。这就是史称“斗鸡之变”的始末。在鲁国这种乱哄哄的内乱局面中，孔子离鲁适齐。“为高昭子家臣，欲以通乎景公”司马迁《史记·孔子世家》。大概高昭子是一个名声不大好的齐国贵族崔述《洙泗考信录》：“《春秋传》，高昭子名张，唁鲁昭公，称为主君；阿景公意，辅孺子荼，卒为陈氏所逐；其不肖如是。”（卷之一），孔子为了通过他去接近齐景公，竟然去做他的家臣，后世儒者认为这是对孔子的诬蔑，好像孔子既是圣人，决不可能做这种事。例如梁玉绳就说：“欲通齐景，不耻家臣，孔子而如是乎？”梁玉绳《史记志疑》“为家臣”这件事的真实性如何，反对者也提不出确证，只凭“讳圣”的主观臆想在那里嚷嚷而已。钱穆认为：“孔子弟子为家臣者多矣，孔子不之禁，则孔子不耻为家臣也。且委吏乘田，独非家臣乎？……不得辄以‘孔子而如是乎’之说为定。”钱穆《先秦诸子系年考辨》第9页。这是颇为公道的评断。"
    },
    {
      "time": "公元前516年",
      "description": "孔子在齐与齐太师语乐，听到《韶》乐（相传是舜时的音乐），三月不知肉味，兴奋地说：“不图为乐之至于斯也！”（《论语·述而》）。齐景公问政于孔子。孔子对曰：“君君，臣臣，父父，子子。”公曰：“善哉！信如君不君，臣不臣，父不父，子不子，虽有粟，吾岂得而食诸！”（《论语·颜渊》）齐景公欲以尼谿田封孔子，但因晏婴阻挠，没有成功（见《史记·孔子世家》）。 这年鲁昭公自齐居郓（郓原是鲁地，上一年齐为昭公攻取）。"
    },
    {
      "time": "公元前515年",
      "description": "孔子在齐，齐大夫扬言欲害孔子，齐景公亦对孔子说：“吾老矣，弗能用也。”于是，孔子自齐返鲁（见《史记·孔子世家》）。据说返鲁时迫于形势险恶，仓促中把正在淘的米未及做饭即提起来一面走路一面滤干。（《孟子·万章下》：“孔子之去齐，接淅而行。”）吴公子季札聘齐，其子死，葬于嬴、博（临近鲁境之齐地）之间，孔子往观其葬礼（见《礼记·檀弓下》）。吴公子光使专诸刺吴王僚而自立，是为吴王阖闾。弟子樊须、原宪生。须字子迟，鲁人；宪字子思，宋人。"
    },
    {
      "time": "公元前514年",
      "description": " 晋魏舒（魏献子）执政，灭祁氏、羊舌氏，分祁氏之田为七县，羊舌氏之田为三县，选派贤能之士（包括其子在内）为县宰。孔子十分赞赏，说魏子之举，“近不失亲，远不失举，可谓义矣。”（《左传·昭公二十八年》）"
    },
    {
      "time": "公元前513年",
      "description": "这年冬，晋铸刑鼎，赵鞅、荀寅把范宣子制定的刑书铸在铁鼎上。孔子认为这样做，就会“贵贱无序”，破坏等级制度，不由得发出了“晋其亡乎！失其度矣”的感叹（《左传·昭公二十九年》）。显然，孔子对晋国法制的看法是保守的。"
    },
    {
      "time": "公元前512年",
      "description": "孔子自称“四十而不惑”（《论语·为政》），所谓不惑，盖指而立时确立的世界观、人生观已坚定不移。弟子澹台灭明生。灭明字子羽，鲁之武城人。"
    },
    {
      "time": "公元前511年",
      "description": "鲁昭公久在乾侯，晋侯欲送昭公回国，鲁之季孙意如来迎，昭公未敢返鲁。弟子陈亢生。亢字子禽，陈人。"
    },
    {
      "time": "公元前510年",
      "description": "旧说孔子于昭公二十六年返鲁后，旋又至齐，直至昭公死，共在齐七年。清人江永在其《乡党图考》中认为孔子在齐不过一年，亦不当。据《史记·孔子世家》考之，孔子仅一次至齐，历时约二年左右。冬，鲁昭公卒于乾侯。季孙立昭公弟公子宋，是为定公。"
    },
    {
      "time": "公元前509年",
      "description": "据《阙里志》载，是年孔子自鲁适陈。《史记·孔子世家》、《陈杞世家》及《年表》均无记载。夏，昭公灵柩自乾侯归葬鲁，定公即位弟子公西赤生。赤字华，鲁国人。"
    },
    {
      "time": "公元前508年",
      "description": "是年鲁国继上年八月严重霜灾后，都城雉门及两观又遭大火。"
    },
    {
      "time": "公元前507年",
      "description": "邾庄公卒，邾隐公即位，将冠，使人问冠礼于孔子。弟子卜商生。商字子夏，卫国人。孔子死后，他在西河讲学，颇有影响。"
    },
    {
      "time": "公元前506年",
      "description": "孔子观鲁桓公庙宥坐（宥与右同，言人君可置于坐右以为戒也）之欹器，联想起“持满”之道，对弟子说：“吾闻宥坐之器者，虚则欹，中则正，满则覆”，“恶有满而不覆者哉！”他认为正确的态度应该是“聪明圣智，守之以愚；功被天下，守之以让；勇力抚世，守之以怯；富有四海，守之以谦；此所谓挹而损之之道也。”（《荀子·宥坐》）吴、蔡、唐联合大败楚师，楚臣申包胥赴秦乞援。弟子言偃生。偃字子游，吴国人。"
    },
    {
      "time": "公元前505年",
      "description": "六月，鲁国季孙意如（季平子）卒，其家臣阳虎（又称阳货）囚其子季孙斯（季桓子）而专鲁政。阳虎欲见孔子，孔子不见，于是馈孔子豚，欲待孔子拜谢时见孔子。孔子不欲见，打听得阳虎不在时拜谢，但不巧在路上遇到了。阳虎劝孔子出仕，孔子口头答应，但终不仕（见《论语·阳货》），退而修《诗》、《书》、《礼》、《乐》，以教弟子。孔子说：“不义而富且贵，于我如浮云。”（《论语·述而》）这充分体现了他的“无道则隐”的主张。楚申包胥求得秦师援助，击败吴师，楚昭王还郢都。弟子曾参、颜幸生。参字子舆，鲁国南武城人。幸字子柳，鲁国人。"
    },
    {
      "time": "公元前504年",
      "description": "季氏家臣阳虎擅权日重。据《左传·定公六年》载，阳虎和定公及“三桓”在周社（社为古代祭祀土地神之所，周社为鲁之国社，因鲁系周公之后，故名周社——作者）盟誓，同国人在亳社（亳为殷商旧都，鲁处殷代商奄之地，因其遗民，故立亳社——作者）盟誓，又在五父之衢（曲阜东南五里处）祭神，以加祸于不守盟誓者。"
    },
    {
      "time": "公元前503年",
      "description": "二月，齐将郓、阳关二地归还鲁国，阳虎据为己有。弟子颛孙师生。师字子张，陈人。"
    },
    {
      "time": "公元前502年",
      "description": "孔子自谓“五十而知天命”（《论语·为政》）。所谓知天命盖即自以为掌握了客观事物的发展规律之意。公山不狃使人召孔子，孔子欲往，因子路反对而未成行（见《论语·阳货》）。冬，阳虎欲去“三桓”，谋杀季氏未遂，随入讙（今山东省宁阳县西北）、阳关（今山东泰安县东南）以叛。"
    },
    {
      "time": "公元前501年",
      "description": "六月，鲁伐阳虎，攻打阳关。阳虎突围奔齐，旋逃亡宋国，最后逃至晋国，投赵简子。孔子说：“赵氏其世有乱乎！”（《左传·定公九年》）孔子任中都（今山东省汶上县西）宰，卓有政绩，治理一年，四方则之。弟子冉鲁、曹卹、伯虔、颜高、叔仲会生。鲁字子鲁，鲁国人；卹字子循，蔡国人；虔字子析，鲁国人；高字子骄，鲁国人；会字子期，鲁国人。真正开始在鲁国做官（“仕鲁”），是鲁定公九年（前501年），当时孔子已经五十一岁，才第一次被定公任命为中都县长（中都宰）。"
    },
    {
      "time": "公元前500年",
      "description": "孔子任中都县长时的政绩，除了上面的一些传说外，在经济上如何发展生产使人民富裕起来（“富之”），在教育上如何巩固和扩大办学规模（“教之”）等等，这些原是他自己一向提倡的，应该有所作为，可惜极少留下记载。由于孔子当时的声望已经很高，做县长的政绩也不差，所以很快就由鲁国的地方官（中都宰）提升为鲁国贵族中央政权的小司空。大司空是孟孙氏世袭的官职，下设相当于现在的助理局长的司空（或叫小司空）。孔子由中都宰升小司空，由小司空升大司寇，摄相事。"
    },
    {
      "time": "公元前499年",
      "description": "孔子为鲁大司寇，鲁国大治。据《吕氏春秋·乐成》记载，开始尚疑其才，既而政化盛行，国人诵之（见《孔丛子·陈士义》）。    鲁与郑讲和，开始背弃晋国。"
    },
    {
      "time": "公元前498年",
      "description": "    孔子为鲁国大司寇，子路为季氏宰，孔子为了削私家以强公室，向鲁定公建议：“家不藏甲，邑无百雉之城，古之制也。今三家（三桓）过制，请皆损之。”（《孔子家语·相鲁》）遂将堕（“堕”同“”，读ｈｕī音）三都。当时，适值叔孙、季孙之家臣侯犯和南蒯各据其都叛，叔、季二氏亦支持这一主张，于是先拆毁了叔孙氏的郈邑（今山东省东平县南）和季孙氏的费邑（今山东省费县）。堕费时，费宰公山不狃乘鲁都（曲阜）空虚，率费人攻曲阜，幸赖孔子命中句须、乐颀二大夫率部反击，败公山不狃于姑蔑（今山东省泗水县东）。公山不狃逃奔齐国。遂堕费。可是再去拆毁孟孙氏的成邑（今山东省宁阳县东北）时，却受到孟孙家臣公敛处父的抵制，结果堕成失败。堕三都行动至此半途而废（《史记·孔子世家》）。有人认为公山弗扰（即不狃）以费畔（《论语·阳货》）即指此事，而召孔子则在定公八年未畔时。甚当。今从此说（详见本书《生平概略》章）。  在鲁定公十二年孔子五十四岁时，受季桓子的委托，由大司寇代理季桓子处理国事并参与国事的讨论，即《史记·孔子世家》所说的“由大司寇行摄相事”和“与闻国政”。在小小的鲁国，在贵族统治集团中，除有名无实的鲁定公和掌握实权的季桓子，这时的孔子已跃居为第三号人物了。大概所谓“孔子行乎季孙，三月不违”按“孔子行乎季孙，三月不违”这句话，曾两见于《公羊传》一次是系于定公十年“夹谷之会”后，一次是系于定公十二年“堕费”、“堕郈”之后。陈立在《公羊义疏》中说：“三月言其久耳，不必仅三月不违也。”此话很对。所谓“不违”，是双方对等而言，即孔子既不违季氏之意，季氏也不违孔子之意，双方上下之间合作得很融洽。这句话应系于“摄相事”、“与闻国政”时较妥。，就是说的这时的情况。但孔子和季氏之间的“蜜月”毕竟是不巩固的、短暂的，时隔不久，在堕三都及其他若干事情上，他们之间的矛盾就显露出来了，“蜜月”就消失了。前面已经说过，孔子的“忠君尊王”思想是坚定不移的。他对于当时鲁国政治的混乱情况——定公虚位、三卿（特别是季氏）擅权，三卿之家又是家臣（如阳货对季氏）垄断——很不满意，认为这是违反“忠君尊王”之道。在这种情况下，他感到出路只有一条，那就是强公室（提高鲁定公的实际统治权力）、抑三卿（使三卿特别是季氏规规矩矩守臣道，不得僭越）、贬家臣（使家臣老老实实效忠于主人，不得跋扈），使鲁国按照周礼，按照贵族等级制封建社会的秩序，治国安民，然后以“仁政德治”的鲁国为基础，扩大“仁政”影响，尊天子，服诸侯，统一天下孔子任中都县长时，鲁定公曾经问孔子：“学子此法以治鲁国何如？”孔子对曰：“虽天下可乎！何但鲁国而已哉！”（《孔子家语·相鲁》）。可见孔子是常以治国平天下为己任的。。堕三都表面上是抑制家臣，是反映“三桓”“三桓”即鲁桓公三个儿子的后裔，其中孟孙氏任司空，叔孙氏任司马，季孙氏任司徒，为鲁国三卿。以季孙氏势力最大，掌握鲁国国政。与家臣之间的矛盾，实质上是公室与“三桓”之间的矛盾，是主张强公室、抑“三桓”的孔子与季桓子之间的矛盾。“三都”是“三桓”实际上割据的领地内的三个城堡，即费邑是季孙氏领地城堡，郈邑是叔孙氏领地城堡，成邑是孟孙氏领地城堡。“三桓”都住在曲阜，所以当时这三个城堡实际又都不在“三桓”控制下，而为他们的家臣所盘据，用以对“三桓”闹独立，侵凌“三桓”，以至越过“三桓”而干预国政，孔子所谓“陪臣执国命”语见《论语·季氏》据《左传》载，昭公十四年南蒯以费叛；定公五年阳虎囚禁季桓子于前，八年又叛鲁奔齐于后；定公十年侯犯又以郈叛。所谓“陪臣执国命”大概就是根据这一系列事件得出的结论。就是指的这个情况。“三桓”对此不满，孔子对此更不满。孔子利用“三桓”尤其是季孙氏对于阳货以费叛（定公八年）、叔孙氏对于侯犯以郈叛（定公十年）的不满情绪，相机建议把家臣（陪臣）据以叛乱的三个城堡拆毁（堕三都），马上得到三家的同意。于是第一步比较顺利地拆了叔孙氏的郈都。第二步拆毁季孙氏的费都时，却遇到费宰（季氏家臣）公山不狃（即心叛季氏而叛迹未著，曾召孔子，孔子欲往的公山弗扰）的强烈反对，并先发制人地以费邑兵力袭击曲阜，幸赖孔子指挥曲阜兵力反击，取得胜利，迫使公山不狃败逃奔齐，终于拆毁了费都。第三步堕成时，情况更复杂，结果完全失败了。开始时，孟孙氏（孟懿子）是赞成堕都的，但因家臣公处父一贯忠于孟孙氏，从无叛意。他看出堕成对孟孙氏不利，便对孟懿子说：“堕成，齐人必至于北门。且成，孟氏之保障也。无成，是无孟氏也。子伪不知，我将不堕。”《左传·定公十二年》孟懿子照计行事，表面仍不反对堕成，暗中却支持公处父全力反抗，抵制堕成。从夏天拖到冬天，成邑城堡依旧屹然未动。不得已，只好在十二月由国君定公亲自出马围成，仍以失败告终。堕成计划没有成功，亦即堕三都计划没有完成。这对孔子是一个致命的打击。前面说过，“三桓”，尤其是季孙氏、叔孙氏慑于家臣据城叛逆事件，赞成堕都，目的是解除后顾之忧，加强自己的力量；孔子主张堕都，不仅是为了削弱家臣力量，也是为了削弱“三桓”力量，目的是强公室，加强国君的地位。对堕三都这件事的用意，形同而实异，即所谓“同床异梦”。公处父的讲话，孟懿子对堕成态度的改变，不得不使季孙氏警醒过来，感到原来孔子主张堕三都的目的是为了削弱“三桓”，加强公室。于是孔子强公室、抑“三桓”（首先是季孙氏）的主张和“三桓”（首先是季孙氏）弱公室、强“三桓”的主张之间矛盾揭开了；“三月不违”的亲密合作动摇了，终止了。要么孔子放弃自己的主张，屈从苟安，要么合作破裂。二者必居其一。孔子当然不会放弃自己的主张（姑不论这主张有多大意义），于是只有让“三月不违”的合作关系破裂，终于导致碰壁、辞官、离鲁的结局。弟子公孙龙生。龙字子石，楚国人。"
    },
    {
      "time": "公元前497年",
      "description": "鲁国得治，齐国惧，欲败其政，乃选美女八十人，衣以文衣，并文马三十驷馈鲁君。季桓子受之，君臣怠于政事，多日不听朝政，也不按礼制送膰肉（当时郊祭用的供肉）于孔子，孔子失望，遂去鲁适卫（孔子去鲁适卫的年代，《史记》定为上一年的秋冬之间，根据鲁国郊祭一般在春三月，故从《阙里志》系于此年）。孔子到卫国后，居住在卫都帝丘（今河南省滑县）子路妻兄颜浊邹家。卫灵公按照他在鲁国的待遇给予俸禄。后卫灵公听信谗言，监视孔子，孔子遂于十月去卫适陈。在过匡地（今河南省长垣县境）时，匡人误认孔子为阳虎（因阳虎曾欺压匡人，而孔子貌似阳虎），围困了孔子。后经蒲地（亦在长垣县境），会公叔氏起事，又被当地群众所围。孔子与蒲人定盟，返回卫国，住蘧伯玉家。"
    },
    {
      "time": "公元前496年",
      "description": "孔子在卫。孔子回到卫国，曾见卫灵公夫人南子，子路不悦；灵公与南子还让孔子为次乘招摇过市，孔子亦耻之，曾去卫而仍回卫。"
    },
    {
      "time": "公元前495年",
      "description": "邾子朝鲁，子贡观礼。鲁定公卒，其子蒋立，是为哀公。"
    },
    {
      "time": "公元前494年",
      "description": "春，吴王夫差败越于夫椒，遂入越。越王勾践退保会稽，使大夫种求和。三月，吴越和。"
    },
    {
      "time": "公元前493年",
      "description": "孔子在卫。孔子看到卫灵公不能用他，喟然叹曰：“苟有用我者，期月而已，三年有成。”卫灵公问兵陈于孔子，孔子说：“俎豆之事则尝闻之，军旅之事未之学也。”（《史记·孔子世家》）由是，决计离卫西去，投奔晋国赵简子。走到大河边，听说赵简子杀害了两个贤人，不由得临河而叹，返回卫国，然后去卫如曹适宋。在适宋的路途上，曾与弟子习礼于檀树之下，宋司马桓魋欲害孔子，把大树砍掉了。孔子只好微服而行，逃到郑国，郑国也没有接待，只好取道适陈。夏，卫灵公卒，立蒯瞶之子辄，是为卫出公。"
    },
    {
      "time": "公元前492年",
      "description": "孔子在陈。这年秋，鲁国季桓子病，懊悔过去未能长期用孔子而影响了鲁国的振兴。临死前，嘱其子季康子要召回孔子以相鲁。后来由于公之鱼的阻拦，季康子改变了主意，派使改召孔子弟子冉求。冉求将行，孔子说：“鲁人召求，非小用之，将大用之也。”（《史记·孔子世家》）这年，孔子已经六十岁了，他很想回到家乡能为鲁国贡献自己的力量。孔子曾说：“六十而耳顺。”意谓这时他听到任何事情，都能立即辨明是非。"
    },
    {
      "time": "公元前491年",
      "description": "孔子六十一岁"
    },
    {
      "time": "公元前490年",
      "description": "《史记》对孔子在卫、在陈的记载很乱，故崔述说：“谓孔子三至卫而三至陈，甚不可解也。”（《洙泗考信录》）。这里只注明孔子以卫、陈为据点的大概年份，略于出入卫、陈的次数和情况，这是年代久远，史无实录，举其大者，舍其细节，较为合理。因此，孔子自陈适蔡，又自蔡回陈等传说，皆从略。"
    },
    {
      "time": "公元前489年",
      "description": "这年吴伐陈，楚来救，陈国大乱。孔子离陈过蔡地去负函（楚地，今河南信阳，楚大夫有贤名的诸梁即叶公驻此），在陈蔡间被困，绝粮七日，弟子饥馁皆病，孔子依然讲诵、弦歌不止。子路等由于屡遭挫折，对孔子之道产生了怀疑。只有颜渊认识到孔子道大，不为当时所容，“是有国者之丑”。孔子为有颜渊这样的弟子感到高兴（《史记·孔子世家》）。孔子在路上连续遇到当时的一些隐者如长沮、桀溺、荷丈人和楚狂接舆等，他们对孔子积极用世态度不以为然。例如桀溺劝子路跟他们一道做避世之人。孔子知道后说：“鸟兽不可与同群，吾非斯人之徒与而谁与？天下有道，丘不与易也。”（《论语·微子》）表示了为改变天下无道局面的决心。又如楚狂接舆遇到孔子时就唱歌道：“凤兮！凤兮！何德之衰！往者不可谏，来者犹可追。已而！已而！今之从政者殆而！”（《论语·微子》）孔子很想和他讲话，可是他急忙避开了，没有讲成。"
    },
    {
      "time": "公元前487年",
      "description": "三月，吴伐鲁，吴大败，孔子弟子有若参战有功。"
    },
    {
      "time": "公元前486年",
      "description": "孔子六十六岁"
    },
    {
      "time": "公元前485年",
      "description": "孔子夫人亓官氏卒。"
    },
    {
      "time": "公元前484年",
      "description": "春，齐师伐鲁，孔子弟子冉有为季氏将左师，与齐军战于鲁郊，克之。季康子问他怎样学会作战的，冉有说，学于孔子，遂荐孔子于季氏。季康子派公华、公宾、公林以币迎孔子归鲁。孔子去鲁访问列国诸侯，颠沛流离凡十四年，至此才算结束。孔子返鲁后，鲁哀公问政，孔子曰：“政在选臣。”（《史记·孔子世家》）又问：“何为则民服？”回答说：“举直错诸枉，则民服；举枉错诸直，则民不服。”（《论语·为政》）季康子问政，孔子说：“政者正也，子帅以正，孰敢不正？”（《论语·颜渊》）季康子欲行“田赋”，即将军费改按田亩征税，使冉有问于孔子，孔子曰：“若不度于礼，而贪冒无厌，则虽以田赋，将又不足。”季子不听（《左传·哀公十一年》）。鲁终不能用孔子，孔子亦不求仕，专心从事文献整理和教育事业，删《诗》、《书》，定《礼》、《乐》，修《春秋》，并且继续聚徒授业，培育治国贤才。据史载，“弟子盖三千焉，身通六艺者七十有二人。”（《史记·孔子世家》）三千是指前后受业弟子总数而言。"
    },
    {
      "time": "公元前483年",
      "description": "夏，鲁昭公夫人孟子卒，孔子往吊。与鲁国太师（乐官）论乐，孔子说：“乐其可知也，始作翕如（热烈），皦如（清晰），纵之纯如（和谐），绎如（络绎不绝）也，以成。”他又说：“吾自卫反鲁，然后乐正，《雅》《颂》各得其所。”（《史记·孔子世家》）冬十二月，鲁国发生蝗灾，季孙问于孔子，孔子说：“丘闻之，火伏而后蛰者毕，今火犹西流，司历过也。”（《左传·哀公十二年》）十二月属冬季，不该有蝗虫。孔子认为这年十二月有蝗虫，不是自然界反常，而是司历者算错了时间。"
    },
    {
      "time": "公元前482年",
      "description": "孔子子伯鱼卒。其孙孔伋约于这年生。伋字子思，曾子的学生，孟轲是其再传弟子。孔子曾说：“七十而从心所欲，不逾矩。”（《论语·为政》）也就是说，到了七十岁，在已往“而立”、“不惑”、“知天命”、“耳顺”的基础上，任何想法和做法都不会越出仁道原则和周礼所定的规矩了。孔子晚而好《易》，“读《易》，韦编三绝”（《史记·孔子世家》）。"
    },
    {
      "time": "公元前481年",
      "description": "孔子在鲁，作《春秋》春，管理山林的人（“虞人”）在曲阜西面的“大野”打猎，捕获一怪兽，据说是麟，孔子说：“吾道穷矣！”于是绝笔，停止修《春秋》颜回死，享年四十一岁，孔子哭之恸，曰：“噫！天丧予！天丧予！”（《论语·先进》）六月，齐国陈恒（又叫田成子）杀简公，孔子劝鲁哀公及“三桓”讨之，以正君臣之义，不果。在齐国这次政变中，孔子弟子宰我死于难。"
    },
    {
      "time": "公元前480年",
      "description": "冬，卫有政变，蒯瞶逐其子出公而自立，是为卫庄公。孔子弟子子路是时为卫大夫孔悝的邑宰，死于难，孔子恸甚。"
    },
    {
      "time": "公元前479年",
      "description": "周历四月十一日即夏历二月十一日（据崔述考证），孔子寝疾七日而殁，葬于鲁城（今曲阜）北泗上。鲁哀公诔之曰：“旻天不吊，不憖遗一老，俾屏余一人以在位，茕茕余在疚，呜呼哀哉！尼父！无自律。”（《左传·哀公十六年》）不少弟子为之守墓三年，临别而去，哭尽哀，或复留。唯子贡庐于墓凡六年，然后去。弟子及鲁人往从墓而家者百有余室，因名孔里；并以孔子故居改为庙堂，藏孔子平生衣冠琴书于堂中。自此以后，年年奉祀。今曲阜之孔庙、孔府、孔林，所谓“三孔”者，即创始于此。"
    }
  ]
}